RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_adc.h
  uint32_t GainCompensation;      /*!< Specify the ADC gain compensation coefficient to be applied to ADC raw
                                       conversion data, based on following formula:
                                           DATA = DATA(raw) * (gain compensation coef) / 4095
                                        14 bit format, unsigned: 2 bits exponents / 14 bits mantissa
                                        Gain step is 1/4095 = 0.000244
                                        Gain range is 0.0000 to 3.999756
                                       This parameter value can be
                                        0           Gain compensation will be disabled and coefficient set to 0
                                        1 -> 0x3FFF Gain compensation will be enabled and coefficient set to
                                                    specified value */

  uint32_t ScanConvMode;          /*!< Configure the sequencer of ADC groups regular and injected.
                                       This parameter can be associated to parameter 'DiscontinuousConvMode'
                                       to have main sequence subdivided in successive parts.
                                       For ADC1 or ADC2 instances, this parameter could be enabled or disabled.
                                       If disabled: Conversion is performed in single mode (one channel converted,
                                                    the one defined in rank 1).
                                                    Parameters 'NbrOfConversion' and 'InjectedNbrOfConversion'
                                                    are discarded (equivalent to set to 1).
                                       If enabled:  Conversions are performed in sequence mode (multiple ranks defined
                                                    by 'NbrOfConversion' or 'InjectedNbrOfConversion' and rank of
                                                    each channel in sequencer).
                                                    Scan direction is upward: from rank 1 to rank 'n'.
                                       For ADC4 instance, this parameter could be "fully configurable" or
                                       "not fully configurable":
                                        - sequencer configured to fully configurable:
                                          sequencer length and each rank affectation to a channel are configurable.
                                           - Sequence length: Set number of ranks in the scan sequence.
                                           - Sequence direction: Unless specified in parameters, sequencer
                                             scan direction is forward (from rank 1 to rank n).
                                        - sequencer configured to not fully configurable:
                                          sequencer length and each rank affectation to a channel are fixed by
                                          channel HW number.
                                           - Sequence length: Number of ranks in the scan sequence is
                                             defined by number of channels set in the sequence,
                                             rank of each channel is fixed by channel HW number.
                                             (channel 0 fixed on rank 0, channel 1 fixed on rank1, ...).
                                           - Sequence direction: Unless specified in parameters, sequencer
                                             scan direction is forward (from lowest channel number to
                                             highest channel number).
                                       This parameter can be a value of @ref ADC_Scan_mode */

  uint32_t DataAlign;             /*!< Specify ADC data alignment in conversion data register (right or left).
                                       Refer to reference manual for alignments formats versus resolutions.
                                       This parameter can be a value of @ref ADC_HAL_EC_DATA_ALIGN */

  uint32_t EOCSelection;          /*!< Specify which EOC (End Of Conversion) flag is used for conversion by polling and
                                       interruption: end of unitary conversion or end of sequence conversions.
                                       This parameter can be a value of @ref ADC_EOCSelection. */

  FunctionalState LowPowerAutoWait; /*!< Select the dynamic low power Auto Delay: new conversion start only when
                                       the previous conversion (for ADC group regular) or previous sequence
                                       (for ADC group injected) has been retrieved by user software, using function
                                       HAL_ADC_GetValue() or HAL_ADCEx_InjectedGetValue().
                                       This feature automatically adapts the frequency of ADC conversions triggers to
                                       the speed of the system that reads the data. Moreover, this avoids risk
                                       of overrun for low frequency applications.
                                       This parameter can be set to ENABLE or DISABLE.
                                       Note: It is not recommended to use with interruption or DMA (HAL_ADC_Start_IT(),
                                             HAL_ADC_Start_DMA()) since these modes have to clear immediately
                                             the EOC flag (by CPU to free the IRQ pending event or by DMA).
                                             Auto wait will work but fort a very short time, discarding its intended
                                             benefit (except specific case of high load of CPU or DMA transfers
                                             which can justify usage of auto wait).
                                             Do use with polling: 1. Start conversion with HAL_ADC_Start(),
                                                                  2. Later on, when ADC conversion data is needed:
                                             use HAL_ADC_GetValue() to retrieve conversion result and trig another
                                             conversion start.
                                             (in case of usage of ADC group injected, use the equivalent functions
                                             HAL_ADCExInjected_Start(), HAL_ADCEx_InjectedGetValue(), ...). */

  uint32_t LowPowerAutoPowerOff;  /*!< Select the auto-off low power mode: the ADC automatically powers-off after
                                        a conversion and automatically wakes-up when a new conversion is triggered.
                                        This feature can be combined with automatic wait mode ('LowPowerAutoWait').
                                        This parameter can be value of @ref ADC_HAL_LowPower_DPD.
                                        Note: If activated, this feature also turns off the ADC dedicated 16 MHz
                                              RC oscillator (HSI16).
                                        Note: This parameter can be used for ADC4 only. */

