RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_adc.h
  FunctionalState ContinuousConvMode; /*!< Specify whether the conversion is performed in single mode (one conversion)
                                        or continuous mode for ADC group regular, after the first ADC conversion start
                                        trigger occurred (software start or external trigger).
                                       This parameter can be set to ENABLE or DISABLE. */

  uint32_t NbrOfConversion;       /*!< Specify the number of ranks that will be converted within the regular group
                                       sequencer.
                                       This parameter is dependent on ADC instance.
                                       If ADC1 or ADC2 instances:
                                       To use the regular group sequencer and convert several ranks,
                                       parameter 'ScanConvMode' must be enabled.
                                       This parameter must be a number between Min_Data = 1 and Max_Data = 16.
                                       If ADC4 instance:
                                       This parameter is dependent on ScanConvMode:
                                        - sequencer configured to fully configurable:
                                          Number of ranks in the scan sequence is configurable using this parameter.
                                          Note: After the first call of 'HAL_ADC_Init()', each rank corresponding
                                          to parameter "NbrOfConversion" must be set using 'HAL_ADC_ConfigChannel()'.
                                                Afterwards, when all needed sequencer ranks are set, parameter
                                                'NbrOfConversion' can be updated without modifying configuration of
                                                sequencer ranks (sequencer ranks above 'NbrOfConversion' are discarded).
                                        - sequencer configured to not fully configurable:
                                          Number of ranks in the scan sequence is defined by number of channels set in
                                          the sequence. This parameter is discarded.
                                       This parameter must be a number between Min_Data = 1 and Max_Data = 8.
                                       Note: This parameter must be modified when no conversion is on going on
                                             regular group (ADC disabled, or ADC enabled without continuous mode
                                             or external trigger that could launch a conversion). */

  FunctionalState DiscontinuousConvMode; /*!< Specify whether the conversions sequence of ADC group regular is
                                       performed in Complete-sequence/Discontinuous-sequence
                                       (main sequence subdivided in successive parts).
                                       Discontinuous mode is used only if sequencer is enabled
                                       (parameter 'ScanConvMode'). If sequencer is disabled, this parameter
                                       is discarded.
                                       Discontinuous mode can be enabled only if continuous mode is disabled.
                                       If continuous mode is enabled, this parameter setting is discarded.
                                       This parameter can be set to ENABLE or DISABLE. */

  uint32_t NbrOfDiscConversion;   /*!< Specifies the number of discontinuous conversions in which the main sequence
                                       of ADC group regular (parameter NbrOfConversion) will be subdivided.
                                       If parameter 'DiscontinuousConvMode' is disabled, this parameter is discarded.
                                       This parameter must be a number between Min_Data = 1 and Max_Data = 8. */

  uint32_t ExternalTrigConv;      /*!< Select the external event source used to trigger ADC group regular
                                       conversion start.
                                       If set to ADC_SOFTWARE_START, external triggers are disabled and software
                                       trigger is used instead.
                                       This parameter can be a value of @ref ADC_regular_external_trigger_source.
                                       Caution: external trigger source is common to all ADC instances. */

  uint32_t ExternalTrigConvEdge;  /*!< Select the external event edge used to trigger ADC group regular
                                       conversion start.
                                       If trigger source is set to ADC_SOFTWARE_START, this parameter is discarded.
                                       This parameter can be a value of @ref ADC_regular_external_trigger_edge */

  uint32_t ConversionDataManagement; /*!< Specifies whether the Data conversion data is managed: using the DMA
                                       (oneshot or circular), or stored in the DR register or
                                       transferred to MDF register.
                                       Note: In continuous mode, DMA must be configured in circular mode.
                                             Otherwise an overrun will be triggered when DMA buffer maximum pointer
                                             is reached.
                                       This parameter can be a value of @ref ADC_ConversionDataManagement.
                                       Note: This parameter must be modified when no conversion is on going on both
                                             regular and injected groups (ADC disabled, or ADC enabled without
                                             continuous mode or external trigger that could launch a conversion). */

  FunctionalState DMAContinuousRequests; /*!< Specify whether the DMA requests are performed in one shot mode
                                             (DMA transfer stops when number of conversions is reached) or in
                                              continuous mode (DMA transfer unlimited, whatever number of conversions).
                                              This parameter can be set to ENABLE or DISABLE.
                                              Note: In continuous mode, DMA must be configured in circular mode.
                                                    Otherwise an overrun will be triggered when DMA buffer maximum
                                                    pointer is reached. */

  uint32_t Overrun;               /*!< Select the behavior in case of overrun: data overwritten or preserved (default).
                                       This parameter applies to ADC group regular only.
                                       This parameter can be a value of @ref ADC_HAL_EC_REG_OVR_DATA_BEHAVIOR.
                                       Note: In case of overrun set to data preserved and usage with programming model
                                             with interruption (HAL_Start_IT()): ADC IRQ handler has to clear end of
                                             conversion flags, this induces the release of the preserved data.
                                             If needed, this data can be saved in function HAL_ADC_ConvCpltCallback(),
                                             placed in user program code (called before end of conversion flags clear).
                                       Note: Error reporting with respect to the conversion mode:
                                             - Usage with ADC conversion by polling for event or interruption:
                                                  Error is reported only if overrun is set to data preserved.
                                                  If overrun is set to data overwritten, user can willingly not read
                                                  all the converted data, this is not considered as an erroneous case.
                                             - Usage with ADC conversion by DMA: Error is reported whatever overrun
                                               setting (DMA is expected to process all data from data register). */

  uint32_t SamplingTimeCommon1;   /*!< Set sampling time common to a group of channels.
                                       Unit: ADC clock cycles.
                                       This parameter is applied for ADC4.
                                       Conversion time is the addition of sampling time and processing time
                                       (12.5 ADC clock cycles at ADC resolution 12 bits, 10.5 cycles at 10 bits,
                                        8.5 cycles at 8 bits).
                                       Note: On this STM32 family, two different sampling time settings are available,
                                             each channel can use one of these two settings.
                                             On some other STM32 devices, this parameter in channel wise and
                                             is located into ADC channel initialization structure.
                                       This parameter can be a value of @ref ADC_HAL_EC_CHANNEL_SAMPLINGTIME
                                       Note: In case of usage of internal measurement channels
                                            (VrefInt/Vbat/TempSensor), sampling time constraints must be respected
                                            (sampling time can be adjusted in function of ADC clock frequency and
                                             sampling time setting).
                                             Refer to device datasheet for timings values, parameters TS_vrefint,
                                             TS_vbat, TS_temp (values rough order: few tens of microseconds). */

  uint32_t SamplingTimeCommon2;   /*!< Set sampling time common to a group of channels, second common setting possible.
                                       Unit: ADC clock cycles
                                       This parameter is applied for ADC4.
                                       Conversion time is the addition of sampling time and processing time (12.5 ADC
                                       clock cycles at ADC resolution 12 bits, 10.5 cycles at 10 bits,
                                       8.5 cycles at 8 bits).
                                       Note: On this STM32 family, two different sampling time settings are available,
                                             each channel can use one of these two settings.
                                             On some other STM32 devices, this parameter in channel wise and is located
                                             into ADC channel initialization structure.
                                       This parameter can be a value of @ref ADC_HAL_EC_CHANNEL_SAMPLINGTIME
                                       Note: In case of usage of internal measurement channels
                                             (VrefInt/Vbat/TempSensor), sampling time constraints must be respected
                                             (sampling time can be adjusted in function of ADC clock frequency and
                                             sampling time setting)
                                             Refer to device datasheet for timings values, parameters TS_vrefint,
                                             TS_vbat, TS_temp (values rough order: few tens of microseconds). */

  uint32_t LeftBitShift;             /*!< Configures the left shifting applied to the final result with or without
                                          oversampling.
                                          This parameter can be a value of @ref ADCEx_Left_Bit_Shift */

  FunctionalState OversamplingMode;       /*!< Specify whether the oversampling feature is enabled or disabled.
                                               This parameter can be set to ENABLE or DISABLE.
                                               Note: This parameter can be modified only if there is no conversion
                                                     is ongoing on ADC groups regular and injected */

  ADC_OversamplingTypeDef Oversampling;   /*!< Specify the Oversampling parameters.
                                               Caution: this setting overwrites the previous oversampling configuration
                                                        if oversampling is already enabled. */

  uint32_t TriggerFrequencyMode;  /*!< Set ADC trigger frequency mode.
                                       This parameter can be a value of @ref ADC_HAL_EC_REG_TRIGGER_FREQ.
                                       Note: ADC trigger frequency mode must be set to low frequency when
                                             a duration is exceeded before ADC conversion start trigger event
                                             (between ADC enable and ADC conversion start trigger event
                                             or between two ADC conversion start trigger event).
                                             Duration value: Refer to device datasheet, parameter "tIdle".
                                       Note: When ADC trigger frequency mode is set to low frequency,
                                             some rearm cycles are inserted before performing ADC conversion
                                             start, inducing a delay of 2 ADC clock cycles. */

  uint32_t VrefProtection;        /*!< Select the Vref protection mode: specify VREF+ protection mode
                                       when multiple ADCs are working simultaneously.
                                       This parameter can be value of @ref ADC_HAL_VrefProt.
                                       Note: This parameter can be used for ADC4 only. */

} ADC_InitTypeDef;

/**
  * @brief  Structure definition of ADC channel for regular group
  * @note   The setting of these parameters by function HAL_ADC_ConfigChannel() is conditioned to ADC state.
  *         ADC state can be either:
  *          - For all parameters: ADC disabled (this is the only possible ADC state to modify parameter 'SingleDiff')
  *          - For all except parameters 'SamplingTime', 'Offset', 'OffsetNumber': ADC enabled without conversion on
  *            going on regular group.
  *          - For parameters 'SamplingTime', 'Offset', 'OffsetNumber': ADC enabled without conversion on going
  *            on regular and injected groups.
  *         If ADC is not in the appropriate state to modify some parameters, these parameters setting is bypassed
  *         without error reporting (as it can be the expected behavior in case of intended action to update another
  *         parameter (which fulfills the ADC state condition) on the fly.
  */
typedef struct
{
  uint32_t Channel;                /*!< Specify the channel to configure into ADC regular group.
                                        This parameter can be a value of @ref ADC_HAL_EC_CHANNEL
                                        Note: Depending on devices and ADC instances, some channels may not be
                                              available on device package pins. Refer to device datasheet for
                                              channels availability. */

  uint32_t Rank;                   /*!< Specify the rank in the regular group sequencer.
                                        This parameter is depending on ADC instances.
                                        If ADC1 or ADC2 instances, this parameter specify the rank in the sequencer.
                                        Note: to disable a channel or change order of conversion sequencer,
                                              rank containing a previous channel setting can be overwritten by
                                        the new channel setting (or parameter number of conversions adjusted)
                                        If ADC4 instance, this parameter allows to add or remove the channel from
                                        the ADC regular group sequencer and specify its conversion rank.
                                        This parameter is depending on ScanConvMode:
                                        - sequencer configured to fully configurable:
                                          Channels ordering into each rank of scan sequence:
                                          whatever channel can be placed into whatever rank.
                                        - sequencer configured to not fully configurable:
                                          rank of each channel is fixed by channel HW number.
                                          (channel 0 fixed on rank 0, channel 1 fixed on rank1, ...).
                                          Despite the channel rank is fixed, this parameter allow an additional
                                          possibility: to remove the selected rank (selected channel) from sequencer.
                                        This parameter can be a value of @ref ADC_HAL_EC_REG_SEQ_RANKS */

