RT-Thread/rt-thread/bsp/stm32/libraries/STM32U5xx_HAL/STM32U5xx_HAL_Driver/Inc/stm32u5xx_hal_adc.h
#define ADC4_EXTERNALTRIG_T1_CC4      (LL_ADC_REG_TRIG_EXT_TIM1_CH4_ADC4)             /*!< ADC group regular conversion trigger from external peripheral: TIM1 channel 4 event (capture compare: input capture or output capture). Trigger edge set to rising edge (default setting). */
#define ADC4_EXTERNALTRIG_T1_TRGO2    (LL_ADC_REG_TRIG_EXT_TIM1_TRGO2_ADC4)
#if defined(TIM2)
#define ADC4_EXTERNALTRIG_T2_TRGO     (LL_ADC_REG_TRIG_EXT_TIM2_TRGO_ADC4)
#endif /* TIM2 */
#if defined(TIM15)
#define ADC4_EXTERNALTRIG_T15_TRGO     (LL_ADC_REG_TRIG_EXT_TIM15_TRGO_ADC4)
#endif /* TIM5 */
#if defined(TIM6)
#define ADC4_EXTERNALTRIG_T6_TRGO     (LL_ADC_REG_TRIG_EXT_TIM6_TRGO_ADC4)
#endif /* TIM6 */

#if defined(LPTIM1)
#define ADC4_EXTERNALTRIG_LPTIM1_CH1  (LL_ADC_REG_TRIG_EXT_LPTIM1_CH1_ADC4)
#endif /* LPTIM1 */

#if defined(LPTIM3)
#define ADC4_EXTERNALTRIG_LPTIM3_CH2  (LL_ADC_REG_TRIG_EXT_LPTIM3_CH2_ADC4)
#endif /* LPTIM3 */
#define ADC4_EXTERNALTRIG_EXT_IT15    (LL_ADC_REG_TRIG_EXT_EXTI_LINE15_ADC4)

/**
  * @}
  */

/** @defgroup ADC_regular_external_trigger_edge ADC group regular trigger edge (when external trigger is selected)
  * @{
  */
#define ADC_EXTERNALTRIGCONVEDGE_NONE           (0x00000000UL)                      /*!< Regular conversions hardware trigger detection disabled */
#define ADC_EXTERNALTRIGCONVEDGE_RISING         (LL_ADC_REG_TRIG_EXT_RISING)        /*!< ADC group regular conversion trigger polarity set to rising edge */
#define ADC_EXTERNALTRIGCONVEDGE_FALLING        (LL_ADC_REG_TRIG_EXT_FALLING)       /*!< ADC group regular conversion trigger polarity set to falling edge */
#define ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING  (LL_ADC_REG_TRIG_EXT_RISINGFALLING) /*!< ADC group regular conversion trigger polarity set to both rising and falling edges */
/**
  * @}
  */

/** @defgroup ADC_EOCSelection ADC sequencer end of unitary conversion or sequence conversions
  * @{
  */
#define ADC_EOC_SINGLE_CONV         (ADC_ISR_EOC)                 /*!< End of unitary conversion flag  */
#define ADC_EOC_SEQ_CONV            (ADC_ISR_EOS)                 /*!< End of sequence conversions flag    */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_REG_OVR_DATA_BEHAVIOR  ADC group regular - Overrun behavior on conversion data
  * @{
  */
#define ADC_OVR_DATA_PRESERVED             (LL_ADC_REG_OVR_DATA_PRESERVED)    /*!< ADC group regular behavior in case of overrun: data preserved */
#define ADC_OVR_DATA_OVERWRITTEN           (LL_ADC_REG_OVR_DATA_OVERWRITTEN)  /*!< ADC group regular behavior in case of overrun: data overwritten */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_REG_SEQ_RANKS  ADC group regular - Sequencer ranks
  * @{
  */
#define ADC_REGULAR_RANK_1                 (LL_ADC_REG_RANK_1)  /*!< ADC group regular sequencer rank 1 */
#define ADC_REGULAR_RANK_2                 (LL_ADC_REG_RANK_2)  /*!< ADC group regular sequencer rank 2 */
#define ADC_REGULAR_RANK_3                 (LL_ADC_REG_RANK_3)  /*!< ADC group regular sequencer rank 3 */
#define ADC_REGULAR_RANK_4                 (LL_ADC_REG_RANK_4)  /*!< ADC group regular sequencer rank 4 */
#define ADC_REGULAR_RANK_5                 (LL_ADC_REG_RANK_5)  /*!< ADC group regular sequencer rank 5 */
#define ADC_REGULAR_RANK_6                 (LL_ADC_REG_RANK_6)  /*!< ADC group regular sequencer rank 6 */
#define ADC_REGULAR_RANK_7                 (LL_ADC_REG_RANK_7)  /*!< ADC group regular sequencer rank 7 */
#define ADC_REGULAR_RANK_8                 (LL_ADC_REG_RANK_8)  /*!< ADC group regular sequencer rank 8 */
#define ADC_REGULAR_RANK_9                 (LL_ADC_REG_RANK_9)  /*!< ADC group regular sequencer rank 9 */
#define ADC_REGULAR_RANK_10                (LL_ADC_REG_RANK_10) /*!< ADC group regular sequencer rank 10 */
#define ADC_REGULAR_RANK_11                (LL_ADC_REG_RANK_11) /*!< ADC group regular sequencer rank 11 */
#define ADC_REGULAR_RANK_12                (LL_ADC_REG_RANK_12) /*!< ADC group regular sequencer rank 12 */
#define ADC_REGULAR_RANK_13                (LL_ADC_REG_RANK_13) /*!< ADC group regular sequencer rank 13 */
#define ADC_REGULAR_RANK_14                (LL_ADC_REG_RANK_14) /*!< ADC group regular sequencer rank 14 */
#define ADC_REGULAR_RANK_15                (LL_ADC_REG_RANK_15) /*!< ADC group regular sequencer rank 15 */
#define ADC_REGULAR_RANK_16                (LL_ADC_REG_RANK_16) /*!< ADC group regular sequencer rank 16 */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_REG_SEQ_RANKS  ADC group regular - Sequencer ranks
  * @{
  */
#define ADC4_RANK_CHANNEL_NUMBER            (0x00000001U)  /*!< Setting relevant if parameter "ScanConvMode" is set to sequencer not fully configurable: Enable the rank of the selected channels. Number of ranks in the sequence is defined by number of channels enabled, rank of each channel is defined by channel number (channel 0 fixed on rank 0, channel 1 fixed on rank1, ...) */
#define ADC4_RANK_NONE                      (0x00000002U)  /*!< Setting relevant if parameter "ScanConvMode" is set to sequencer not fully configurable: Disable the selected rank (selected channel) from sequencer */

#define ADC4_REGULAR_RANK_1                 (LL_ADC_REG_RANK_1_ADC4)  /*!< ADC group regular sequencer rank 1 */
#define ADC4_REGULAR_RANK_2                 (LL_ADC_REG_RANK_2_ADC4)  /*!< ADC group regular sequencer rank 2 */
#define ADC4_REGULAR_RANK_3                 (LL_ADC_REG_RANK_3_ADC4)  /*!< ADC group regular sequencer rank 3 */
#define ADC4_REGULAR_RANK_4                 (LL_ADC_REG_RANK_4_ADC4)  /*!< ADC group regular sequencer rank 4 */
#define ADC4_REGULAR_RANK_5                 (LL_ADC_REG_RANK_5_ADC4)  /*!< ADC group regular sequencer rank 5 */
#define ADC4_REGULAR_RANK_6                 (LL_ADC_REG_RANK_6_ADC4)  /*!< ADC group regular sequencer rank 6 */
#define ADC4_REGULAR_RANK_7                 (LL_ADC_REG_RANK_7_ADC4)  /*!< ADC group regular sequencer rank 7 */
#define ADC4_REGULAR_RANK_8                 (LL_ADC_REG_RANK_8_ADC4)  /*!< ADC group regular sequencer rank 8 */

/**
  * @}
  */
/** @defgroup ADC_HAL_EC_SAMPLINGTIME_COMMON  ADC instance - Sampling time common to a group of channels
  * @{
  */
#define ADC4_SAMPLINGTIME_COMMON_1          (LL_ADC_SAMPLINGTIME_COMMON_1) /*!< Set sampling time common to a group of channels: sampling time nb 1 */
#define ADC4_SAMPLINGTIME_COMMON_2          (LL_ADC_SAMPLINGTIME_COMMON_2) /*!< Set sampling time common to a group of channels: sampling time nb 2 */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_CHANNEL_SAMPLINGTIME  Channel - Sampling time
  * @{
  */
#define ADC_SAMPLETIME_5CYCLE          (LL_ADC_SAMPLINGTIME_5CYCLE)     /*!< Sampling time 5 ADC clock cycles */
#define ADC_SAMPLETIME_6CYCLES         (LL_ADC_SAMPLINGTIME_6CYCLES)    /*!< Sampling time 6 ADC clock cycles */
#define ADC_SAMPLETIME_12CYCLES        (LL_ADC_SAMPLINGTIME_12CYCLES)   /*!< Sampling time 12 ADC clock cycles */
#define ADC_SAMPLETIME_20CYCLES        (LL_ADC_SAMPLINGTIME_20CYCLES)   /*!< Sampling time 20 ADC clock cycles */
#define ADC_SAMPLETIME_36CYCLES        (LL_ADC_SAMPLINGTIME_36CYCLES)   /*!< Sampling time 36 ADC clock cycles */
#define ADC_SAMPLETIME_68CYCLES        (LL_ADC_SAMPLINGTIME_68CYCLES)   /*!< Sampling time 68 ADC clock cycles */
#define ADC_SAMPLETIME_391CYCLES_5     (LL_ADC_SAMPLINGTIME_391CYCLES_5)/*!< Sampling time 391.5 ADC clock cycles */
#define ADC_SAMPLETIME_814CYCLES       (LL_ADC_SAMPLINGTIME_814CYCLES)  /*!< Sampling time 814 ADC clock cycles */
/**
  * @}
  */

/** @defgroup ADC_HAL_EC_CHANNEL_SAMPLINGTIME  Channel - Sampling time
  * @{
  */
#define ADC4_SAMPLETIME_1CYCLE_5            (LL_ADC4_SAMPLINGTIME_1CYCLE_5)     /*!< Sampling time 1.5 ADC clock cycle */
#define ADC4_SAMPLETIME_3CYCLES_5           (LL_ADC4_SAMPLINGTIME_3CYCLES_5)    /*!< Sampling time 3.5 ADC clock cycles */
#define ADC4_SAMPLETIME_7CYCLES_5           (LL_ADC4_SAMPLINGTIME_7CYCLES_5)    /*!< Sampling time 7.5 ADC clock cycles */
#define ADC4_SAMPLETIME_12CYCLES_5          (LL_ADC4_SAMPLINGTIME_12CYCLES_5)   /*!< Sampling time 12.5 ADC clock cycles */
#define ADC4_SAMPLETIME_19CYCLES_5          (LL_ADC4_SAMPLINGTIME_19CYCLES_5)   /*!< Sampling time 19.5 ADC clock cycles */
#define ADC4_SAMPLETIME_39CYCLES_5          (LL_ADC4_SAMPLINGTIME_39CYCLES_5)   /*!< Sampling time 39.5 ADC clock cycles */
#define ADC4_SAMPLETIME_79CYCLES_5          (LL_ADC4_SAMPLINGTIME_79CYCLES_5)   /*!< Sampling time 79.5 ADC clock cycles */
#define ADC4_SAMPLETIME_160CYCLES_5         (LL_ADC4_SAMPLINGTIME_160CYCLES_5)  /*!< Sampling time 160.5 ADC clock cycles */
/**
  * @}
  */

/** @defgroup ADCEx_Calibration_Mode   ADC Extended Calibration mode offset mode or linear mode
  * @{
  */
#define ADC_CALIB_OFFSET                   (LL_ADC_CALIB_OFFSET)
#define ADC_CALIB_OFFSET_LINEARITY         (LL_ADC_CALIB_OFFSET_LINEARITY)
/**
  * @}
  */

